Revit 2027 API
BuiltInFailures.StairRampFailures.StairsCannotExtendToFloorStructureLayerWarning Property
 Stairs cannot extend to floor structure layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsCannotExtendToFloorStructureLayerWarning { get; }
Public Shared ReadOnly Property StairsCannotExtendToFloorStructureLayerWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsCannotExtendToFloorStructureLayerWarning {
	FailureDefinitionId^ get ();
}
static member StairsCannotExtendToFloorStructureLayerWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace